In [3]:
import pandas as pd
import numpy as np
import datetime
import warnings
import matplotlib.pyplot as plt
import seaborn as sns

warnings.filterwarnings('ignore')

# DATA WRANGLING

Importing the Data

In [5]:
data = pd.read_csv('learningSet.csv.zip')

Exploring the Data

We will check the data types, unique values, null values and statistical overview of the data

Data Overview

In [6]:
data.shape

(95412, 481)

In [7]:
data.describe()

,ODATEDW,TCODE,DOB,AGE,NUMCHLD,INCOME,WEALTH1,HIT,MBCRAFT,MBGARDEN,...,FISTDATE,NEXTDATE,TIMELAG,AVGGIFT,CONTROLN,TARGET_B,TARGET_D,HPHONE_D,RFA_2F,CLUSTER2
count,95412.000000,95412.000000,95412.000000,71747.000000,12386.000000,74126.000000,50680.000000,95412.000000,42558.000000,42558.000000,...,95412.000000,85439.000000,85439.000000,95412.000000,95412.000000,95412.000000,95412.000000,95412.000000,95412.000000,95280.000000
mean,9141.363256,54.223117,2723.602933,61.611649,1.527773,3.886248,5.345699,3.321438,0.152075,0.059166,...,9135.651648,9151.022917,8.093739,13.347786,95778.176959,0.050759,0.793073,0.500618,1.910053,31.533711
std,343.454752,953.844476,2132.241295,16.664199,0.806861,1.854960,2.742490,9.306899,0.470023,0.262078,...,320.394019,294.257260,8.213242,10.769997,55284.596094,0.219506,4.429725,0.500002,1.072749,18.764614
min,8306.000000,0.000000,0.000000,1.000000,1.000000,1.000000,0.000000,0.000000,0.000000,0.000000,...,0.000000,7211.000000,0.000000,1.285714,1.000000,0.000000,0.000000,0.000000,1.000000,1.000000
25%,8801.000000,0.000000,201.000000,48.000000,1.000000,2.000000,3.000000,0.000000,0.000000,0.000000,...,8810.000000,8903.000000,4.000000,8.384615,47910.750000,0.000000,0.000000,0.000000,1.000000,15.000000
50%,9201.000000,1.000000,2610.000000,62.000000,1.000000,4.000000,6.000000,0.000000,0.000000,0.000000,...,9201.000000,9204.000000,6.000000,11.636364,95681.500000,0.000000,0.000000,1.000000,2.000000,32.000000
75%,9501.000000,2.000000,4601.000000,75.000000,2.000000,5.000000,8.000000,3.000000,0.000000,0.000000,...,9409.000000,9409.000000,11.000000,15.477955,143643.500000,0.000000,0.000000,1.000000,3.000000,49.000000
max,9701.000000,72002.000000,9710.000000,98.000000,7.000000,7.000000,9.000000,241.000000,6.000000,4.000000,...,9603.000000,9702.000000,1088.000000,1000.000000,191779.000000,1.000000,200.000000,1.000000,4.000000,62.000000

In [8]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 95412 entries, 0 to 95411
Columns: 481 entries, ODATEDW to GEOCODE2
dtypes: float64(97), int64(310), object(74)
memory usage: 350.1+ MB

Checking the Null Values

In [9]:
data.isna().sum()

ODATEDW       0
OSOURCE       0
TCODE         0
STATE         0
ZIP           0
           ...
MDMAUD_R      0
MDMAUD_F      0
MDMAUD_A      0
CLUSTER2    132
GEOCODE2    132
Length: 481, dtype: int64

In [10]:
def check_nan(df):
    nulls = pd.DataFrame((df.isna().sum()/len(df))*100)
    nulls = nulls.reset_index()
    nulls.columns = ['column_name', 'percentage_null_values']
    nulls.sort_values(by='percentage_null_values', ascending = False, inplace = True)
    return nulls

In [11]:
nulls = check_nan(data)
nulls

    column_name  percentage_null_values
414     RDATE_5               99.990567
436     RAMNT_5               99.990567
412     RDATE_3               99.746363
434     RAMNT_3               99.746363
413     RDATE_4               99.705488
..          ...                     ...
168       ETHC3                0.000000
167       ETHC2                0.000000
166       ETHC1                0.000000
165       HHD12                0.000000
240       TPE11                0.000000

[481 rows x 2 columns]

In [12]:
only_nulls = nulls[nulls['percentage_null_values']>0]
only_nulls.describe()

       percentage_null_values
count               92.000000
mean                58.770249
std                 32.281668
min                  0.138347
25%                 32.986941
50%                 63.800675
75%                 87.160944
max                 99.990567

We create a list where we will put the columns we want to drop

In [13]:
OSOURCE - symbol definitions not provided, too many categories \ ZIP CODE - we are including state already

SyntaxError: invalid syntax (Temp/ipykernel_53552/1800545982.py, line 1)

In [14]:
data['ZIP']

0        61081
1        91326
2        27017
3        95953
4        33176
         ...
95407    99504
95408    77379
95409    48910
95410    91320
95411    28409
Name: ZIP, Length: 95412, dtype: object

In [15]:
drop_1 = data[['OSOURCE','ZIP']]
drop_list = drop_1.columns.tolist()
drop_list

['OSOURCE', 'ZIP']

In [16]:
Identify columns that over 85% missing values

SyntaxError: invalid syntax (Temp/ipykernel_53552/1547462560.py, line 1)

In [17]:
eighty_five = nulls[nulls['percentage_null_values']>=85]
eighty_five

    column_name  percentage_null_values
414     RDATE_5               99.990567
436     RAMNT_5               99.990567
412     RDATE_3               99.746363
434     RAMNT_3               99.746363
413     RDATE_4               99.705488
435     RAMNT_4               99.705488
437     RAMNT_6               99.186685
415     RDATE_6               99.186685
446    RAMNT_15               92.388798
424    RDATE_15               92.388798
432    RDATE_23               91.763091
454    RAMNT_23               91.763091
429    RDATE_20               91.732696
451    RAMNT_20               91.732696
438     RAMNT_7               90.677273
416     RDATE_7               90.677273
448    RAMNT_17               90.146942
426    RDATE_17               90.146942
430    RDATE_21               90.029556
452    RAMNT_21               90.029556
441    RAMNT_10               89.035970
419    RDATE_10               89.035970
422    RDATE_13               87.160944
444    RAMNT_13               87.160944
23      NUMCHLD               87.018404

In [18]:
for name in eighty_five.column_name:
    drop_list.append(name)
    
drop_list

['OSOURCE',
 'ZIP',
 'RDATE_5',
 'RAMNT_5',
 'RDATE_3',
 'RAMNT_3',
 'RDATE_4',
 'RAMNT_4',
 'RAMNT_6',
 'RDATE_6',
 'RAMNT_15',
 'RDATE_15',
 'RDATE_23',
 'RAMNT_23',
 'RDATE_20',
 'RAMNT_20',
 'RAMNT_7',
 'RDATE_7',
 'RAMNT_17',
 'RDATE_17',
 'RDATE_21',
 'RAMNT_21',
 'RAMNT_10',
 'RDATE_10',
 'RDATE_13',
 'RAMNT_13',
 'NUMCHLD']

Removing those columns from the dataframe

In [19]:
data_no_nulls = data.drop(columns=drop_list)
nulls_2 = check_nan(data_no_nulls)
nulls_2 = nulls_2[nulls_2['percentage_null_values']>0]
nulls_2

    column_name  percentage_null_values
421    RAMNT_11               84.551209
411    RDATE_11               84.551209
426    RAMNT_19               83.359535
416    RDATE_19               83.359535
410     RDATE_9               82.461326
..          ...                     ...
192         MSA                0.138347
193         ADI                0.138347
194         DMA                0.138347
453    GEOCODE2                0.138347
452    CLUSTER2                0.138347

[67 rows x 2 columns]

In [20]:
nulls_2.describe()

       percentage_null_values
count               67.000000
mean                45.921130
std                 28.493307
min                  0.138347
25%                 21.814342
50%                 55.395548
75%                 73.064185
max                 84.551209

# Data Cleaning

Cleaning Gender

In [21]:
data_no_nulls.GENDER.value_counts()

F    51277
M    39094
      2957
U     1715
J      365
C        2
A        2
Name: GENDER, dtype: int64

In [22]:
data_no_nulls['GENDER'] = np.where(data_no_nulls['GENDER'].isin(['F','M']), data_no_nulls['GENDER'], "other")
data_no_nulls.GENDER.value_counts()

F        51277
M        39094
other     5041
Name: GENDER, dtype: int64

Checking and cleaning the Nans in GENDER

No nulls in the column

In [23]:
data_no_nulls.GENDER.isna().sum()

0